---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint
source: html/e382e365-b533-c3f1-3e01-f95b4c6c3250.htm
---
# RebarShapeConstraint Properties

Specifies whether the .NET object represents a valid Revit entity.